Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

source: Run approved, bounded file and text commands inside AmberAgent's stable app-owned /workspace and return separate stdout, stderr, and exit code. A system shell, package installation, and durable background execution are not available.
ja: AmberAgent のアプリ所有の安定版 /workspace 内で、承認済みの制限付きファイル／テキストコマンドを実行し、stdout、stderr、終了コードを個別に返します。システムシェル、パッケージのインストール、永続的なバックグラウンド実行は利用できません。
ko: AmberAgent가 소유한 안정 버전 /workspace에서 승인된 제한 파일/텍스트 명령을 실행하고 stdout, stderr, 종료 코드를 별도로 반환합니다. 시스템 셸, 패키지 설치 및 지속적인 백그라운드 실행은 사용할 수 없습니다.
ru: Выполняет одобренные ограниченные файловые и текстовые команды в принадлежащем приложению AmberAgent стабильном /workspace и отдельно возвращает stdout, stderr и код выхода. Системная оболочка, установка пакетов и длительное выполнение в фоне недоступны.
zh_hans: 在 AmberAgent 稳定版 App 自有的 /workspace 中执行经批准的受限文件和文本命令，并分别返回 stdout、stderr 和退出码。不提供 system shell、安装 package 或持久后台执行。
zh_hant: 在 AmberAgent 穩定版 App 自有的 /workspace 中執行經核准的受限檔案與文字命令，並分別回傳 stdout、stderr 與結束碼。不提供 system shell、套件安裝或持續背景執行。

# 在 /workspace 执行受限本地命令
source: Run bounded local commands in /workspace
ja: /workspace で制限付きローカルコマンドを実行
ko: /workspace에서 제한된 로컬 명령 실행
ru: Выполнять ограниченные локальные команды в /workspace
zh_hans: 在 /workspace 执行受限本地命令
zh_hant: 在 /workspace 執行受限本機命令

# 执行 AmberShell
source: Run AmberShell
ja: AmberShell を実行
ko: AmberShell 실행
ru: Выполнить AmberShell
zh_hans: 执行 AmberShell
zh_hant: 執行 AmberShell

# 稳定版本地执行
source: Stable local execution
ja: 安定版ローカル実行
ko: 안정 버전 로컬 실행
ru: Стабильное локальное выполнение
zh_hans: 稳定版本地执行
zh_hant: 穩定版本機執行

# 审批前检查 AmberShell 的完整命令
source: Review the full AmberShell command before approving
ja: 承認前に AmberShell の完全なコマンドを確認
ko: 승인 전에 전체 AmberShell 명령 검토
ru: Проверить полную команду AmberShell перед подтверждением
zh_hans: 审批前检查 AmberShell 的完整命令
zh_hant: 核准前檢查 AmberShell 的完整命令

# Amber 将在 App 自有 /workspace 中执行一次非交互 AmberShell 命令，并回传 stdout/stderr/exit code。
source: Amber will run one non-interactive AmberShell command in the app-owned /workspace and return stdout/stderr/exit code.
ja: Amber は App 所有の /workspace で非対話型の AmberShell コマンドを1回実行し、stdout/stderr/exit code を返します。
ko: Amber는 앱 소유 /workspace에서 비대화형 AmberShell 명령을 한 번 실행하고 stdout/stderr/exit code를 반환합니다.
ru: Amber выполнит одну неинтерактивную команду AmberShell в принадлежащем приложению /workspace и вернёт stdout/stderr/exit code.
zh_hans: Amber 将在 App 自有 /workspace 中执行一次非交互 AmberShell 命令，并回传 stdout/stderr/exit code。
zh_hant: Amber 會在 App 自有的 /workspace 中執行一次非互動式 AmberShell 命令，並回傳 stdout/stderr/exit code。

# 模式：稳定版本地执行（无 PTY）
source: Mode: stable local execution (no PTY)
ja: モード：安定版ローカル実行（PTY なし）
ko: 모드: 안정 버전 로컬 실행(PTY 없음)
ru: Режим: стабильное локальное выполнение (без PTY)
zh_hans: 模式：稳定版本地执行（无 PTY）
zh_hant: 模式：穩定版本機執行（無 PTY）

# 工作目录：%@
source: Working directory: %@
ja: 作業ディレクトリ：%@
ko: 작업 디렉터리: %@
ru: Рабочий каталог: %@
zh_hans: 工作目录：%@
zh_hant: 工作目錄：%@

# 超时：%lld 秒（协作式）
source: Timeout: %lld seconds (cooperative)
ja: タイムアウト：%lld秒（協調的）
ko: 시간 초과: %lld초(협력 방식)
ru: Тайм-аут: %lld с (кооперативный)
zh_hans: 超时：%lld 秒（协作式）
zh_hant: 逾時：%lld 秒（協作式）

source: stdin: %lld bytes
ja: stdin：%lldバイト
ko: stdin: %lld바이트
ru: stdin: %lld байт
zh_hans: stdin：%lld 字节
zh_hant: stdin：%lld 位元組

# 批准范围，仅这一次
source: Approval scope, only this time
ja: 承認範囲、今回のみ
ko: 승인 범위, 이번 한 번만
ru: Область подтверждения: только сейчас
zh_hans: 批准范围，仅这一次
zh_hant: 核准範圍，僅這一次

# 当前策略需要逐次前台审批；开启高风险自动批准后可跳过。
source: The current policy requires foreground approval for each run; enabling high-risk auto-approval skips it.
ja: 現在のポリシーでは実行ごとにフォアグラウンド承認が必要です。高リスクの自動承認を有効にすると省略できます。
ko: 현재 정책에서는 실행할 때마다 포그라운드 승인이 필요합니다. 고위험 자동 승인을 켜면 건너뜁니다.
ru: Текущая политика требует подтверждения на переднем плане для каждого запуска; его можно пропустить, включив автоматическое подтверждение высокого риска.
zh_hans: 当前策略需要逐次前台审批；开启高风险自动批准后可跳过。
zh_hant: 目前策略需要逐次前景核准；開啟高風險自動核准後可略過。

# 选择 Amber 执行命令的方式，也可以在这里配置 SSH 和 iSH。
source: Choose how Amber runs commands. You can also configure SSH and iSH here.
ja: Amber がコマンドを実行する方法を選択します。ここで SSH と iSH も設定できます。
ko: Amber가 명령을 실행하는 방식을 선택하세요. 여기에서 SSH와 iSH도 설정할 수 있습니다.
ru: Выберите, как Amber будет выполнять команды. Здесь также можно настроить SSH и iSH.
zh_hans: 选择 Amber 执行命令的方式，也可以在这里配置 SSH 和 iSH。
zh_hant: 選擇 Amber 執行命令的方式，也可以在這裡設定 SSH 和 iSH。

# 选择 Amber 执行命令的方式。
source: Choose how Amber runs commands.
ja: Amber がコマンドを実行する方法を選択します。
ko: Amber가 명령을 실행하는 방식을 선택하세요.
ru: Выберите, как Amber будет выполнять команды.
zh_hans: 选择 Amber 执行命令的方式。
zh_hant: 選擇 Amber 執行命令的方式。

# 选择运行环境
source: Choose a Runtime
ja: 実行環境を選択
ko: 실행 환경 선택
ru: Выбор среды выполнения
zh_hans: 选择运行环境
zh_hant: 選擇執行環境

# 默认运行环境
source: Default Runtime
ja: デフォルトの実行環境
ko: 기본 실행 환경
ru: Среда выполнения по умолчанию
zh_hans: 默认运行环境
zh_hant: 預設執行環境

# 更多运行环境
source: More Runtimes
ja: その他の実行環境
ko: 더 많은 실행 환경
ru: Другие среды выполнения
zh_hans: 更多运行环境
zh_hant: 更多執行環境

# 默认环境会用于聊天命令和测试。AmberShell 是否询问取决于执行策略。
source: The default environment is used for chat commands and tests. Whether AmberShell asks first depends on the execution policy.
ja: デフォルト環境はチャットコマンドとテストに使用されます。AmberShell が確認を求めるかどうかは実行ポリシーによります。
ko: 기본 환경은 채팅 명령과 테스트에 사용됩니다. AmberShell의 확인 여부는 실행 정책에 따라 달라집니다.
ru: Среда по умолчанию используется для команд в чате и тестов. Запрос подтверждения AmberShell зависит от политики выполнения.
zh_hans: 默认环境会用于聊天命令和测试。AmberShell 是否询问取决于执行策略。
zh_hant: 預設環境會用於聊天命令和測試。AmberShell 是否詢問取決於執行策略。

source: Configure the execution boundaries for AmberShell, Remote SSH, and iSH. AmberShell runs bounded non-PTY commands in the app-owned /workspace and requires approval for each run. It supports pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date, uname, and restricted python -c (CPython 3.14, with no pip, network, or host-file access). It supports up to three pipeline stages and only <, >, and 2> redirection; system shells, PTY, control flow, globbing, command substitution, and package installation are unavailable.
ja: AmberShell、Remote SSH、iSH の実行範囲を設定します。AmberShell は App 所有の /workspace で制限付きの非 PTY コマンドを実行し、毎回承認が必要です。pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname と、制限付きの python -c（CPython 3.14、pip・ネットワーク・ホストファイルへのアクセスなし）に対応します。パイプラインは最大3段で、リダイレクトは <、>、2> のみです。system shell、PTY、制御フロー、glob、コマンド置換、パッケージのインストールは利用できません。
ko: AmberShell, Remote SSH 및 iSH의 실행 범위를 설정합니다. AmberShell은 앱이 소유한 /workspace에서 제한된 비대화형(non-PTY) 명령을 실행하며 매번 승인이 필요합니다. pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date, uname 및 제한된 python -c(CPython 3.14, pip·네트워크·호스트 파일 접근 없음)를 지원합니다. 파이프라인은 최대 3단계이며 리디렉션은 <, >, 2>만 지원합니다. system shell, PTY, 제어 흐름, glob, 명령 치환 및 패키지 설치는 제공하지 않습니다.
ru: Настройте границы выполнения AmberShell, Remote SSH и iSH. AmberShell запускает ограниченные команды без PTY в принадлежащем приложению /workspace; для каждого запуска требуется подтверждение. Поддерживаются pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date, uname и ограниченный python -c (CPython 3.14, без pip, сети и доступа к файлам хоста). Допускается до трёх этапов конвейера и только перенаправления <, > и 2>; системная оболочка, PTY, управление потоком, glob, подстановка команд и установка пакетов недоступны.
zh_hans: 配置 AmberShell、Remote SSH 与 iSH 的执行边界。AmberShell 在 App 自有 /workspace 中运行受限非 PTY 命令并逐次审批；支持 pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname，以及受限 python -c（CPython 3.14，无 pip、网络或宿主文件访问）；最多三段管道，仅支持 <、>、2> 重定向；不提供 system shell、PTY、控制流、glob、命令替换或 package install。
zh_hant: 設定 AmberShell、Remote SSH 與 iSH 的執行邊界。AmberShell 會在 App 自有的 /workspace 中執行受限的非 PTY 命令，且每次都需要核准；支援 pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname，以及受限的 python -c（CPython 3.14，不提供 pip、網路或主機檔案存取）；最多三段管線，僅支援 <、>、2> 重新導向；不提供 system shell、PTY、控制流程、glob、命令替換或套件安裝。

source: Configure the execution boundaries for AmberShell, Remote SSH, and iSH. AmberShell runs bounded non-PTY commands in the app-owned /workspace and requires approval for each run. It supports pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date, and uname. It supports up to three pipeline stages and only <, >, and 2> redirection; the current ExperimentalGPL target does not link CPython. System shells, PTY, control flow, globbing, command substitution, and package installation are unavailable.
ja: AmberShell、Remote SSH、iSH の実行範囲を設定します。AmberShell は App 所有の /workspace で制限付きの非 PTY コマンドを実行し、毎回承認が必要です。pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname に対応します。パイプラインは最大3段で、リダイレクトは <、>、2> のみです。現在の ExperimentalGPL target には CPython がリンクされていません。system shell、PTY、制御フロー、glob、コマンド置換、パッケージのインストールは利用できません。
ko: AmberShell, Remote SSH 및 iSH의 실행 범위를 설정합니다. AmberShell은 앱이 소유한 /workspace에서 제한된 비대화형(non-PTY) 명령을 실행하며 매번 승인이 필요합니다. pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date, uname을 지원합니다. 파이프라인은 최대 3단계이며 리디렉션은 <, >, 2>만 지원합니다. 현재 ExperimentalGPL target에는 CPython이 링크되지 않습니다. system shell, PTY, 제어 흐름, glob, 명령 치환 및 패키지 설치는 제공하지 않습니다.
ru: Настройте границы выполнения AmberShell, Remote SSH и iSH. AmberShell запускает ограниченные команды без PTY в принадлежащем приложению /workspace; для каждого запуска требуется подтверждение. Поддерживаются pwd, ls, echo, cat, mkdir, touch, cp, mv, rm, head, tail, wc, printf, grep, sort, uniq, cut, tr, basename, dirname, env, date и uname. Допускается до трёх этапов конвейера и только перенаправления <, > и 2>; текущий target ExperimentalGPL не подключает CPython. Системная оболочка, PTY, управление потоком, glob, подстановка команд и установка пакетов недоступны.
zh_hans: 配置 AmberShell、Remote SSH 与 iSH 的执行边界。AmberShell 在 App 自有 /workspace 中运行受限非 PTY 命令并逐次审批；支持 pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname；最多三段管道，仅支持 <、>、2> 重定向；当前 ExperimentalGPL target 不链接 CPython；不提供 system shell、PTY、控制流、glob、命令替换或 package install。
zh_hant: 設定 AmberShell、Remote SSH 與 iSH 的執行邊界。AmberShell 會在 App 自有的 /workspace 中執行受限的非 PTY 命令，且每次都需要核准；支援 pwd、ls、echo、cat、mkdir、touch、cp、mv、rm、head、tail、wc、printf、grep、sort、uniq、cut、tr、basename、dirname、env、date、uname；最多三段管線，僅支援 <、>、2> 重新導向；目前的 ExperimentalGPL target 不連結 CPython；不提供 system shell、PTY、控制流程、glob、命令替換或套件安裝。

source: The default Runtime affects foreground tests and chat command entry points. AmberShell requires approval for each run, supports bounded file/text commands and up to three pipeline stages, and uses a 60-second cooperative timeout by default; a blocking native extension must return before it can finish. iSH tools are controlled separately below.
ja: デフォルト Runtime はフォアグラウンドのテストとチャットのコマンド入口に影響します。AmberShell は毎回承認が必要で、制限付きのファイル／テキストコマンドと最大3段のパイプラインに対応し、既定のタイムアウトは60秒（協調的）です。ブロッキングするネイティブ拡張は、終了する前に戻る必要があります。iSH ツールは下で個別に管理します。
ko: 기본 Runtime은 포그라운드 테스트와 채팅 명령 진입점에 영향을 줍니다. AmberShell은 매번 승인이 필요하고 제한된 파일/텍스트 명령과 최대 3단계 파이프라인을 지원하며 기본 협력 방식 시간 초과는 60초입니다. 차단 중인 네이티브 확장은 완료되기 전에 반환되어야 합니다. iSH 도구는 아래에서 별도로 제어합니다.
ru: Runtime по умолчанию влияет на проверки на переднем плане и точки входа команд чата. Для каждого запуска AmberShell требуется подтверждение; поддерживаются ограниченные файловые и текстовые команды и до трёх этапов конвейера, а тайм-аут по умолчанию составляет 60 секунд (кооперативный). Блокирующее нативное расширение должно вернуть управление, прежде чем выполнение завершится. Инструменты iSH настраиваются отдельно ниже.
zh_hans: 默认 Runtime 影响前台测试与聊天命令入口；AmberShell 逐次审批，支持受限文件/文本命令与最多三段管道，默认 60 秒协作式超时；阻塞的原生扩展需返回后才能结束。iSH 工具在下方单独控制。
zh_hant: 預設 Runtime 會影響前景測試與聊天命令入口；AmberShell 一律逐次核准，支援受限檔案／文字命令與最多三段管線，預設採 60 秒協作式逾時；阻塞的原生擴充功能必須先返回，執行才能結束。iSH 工具會在下方個別控制。

# iSH 工具
source: iSH tools
ja: iSH ツール
ko: iSH 도구
ru: Инструменты iSH
zh_hans: iSH 工具
zh_hant: iSH 工具

# AmberShell、Remote SSH 与 iSH 使用各自能力闸门；AmberShell 遵循高风险自动批准设置。
source: AmberShell, Remote SSH, and iSH use separate capability gates; AmberShell follows the high-risk auto-approval setting.
ja: AmberShell、Remote SSH、iSH はそれぞれ別の機能ゲートを使用し、AmberShell は高リスクの自動承認設定に従います。
ko: AmberShell, Remote SSH 및 iSH는 각각 별도의 기능 게이트를 사용하며 AmberShell은 고위험 자동 승인 설정을 따릅니다.
ru: AmberShell, Remote SSH и iSH используют отдельные шлюзы возможностей; AmberShell следует настройке автоматического подтверждения высокого риска.
zh_hans: AmberShell、Remote SSH 与 iSH 使用各自能力闸门；AmberShell 遵循高风险自动批准设置。
zh_hant: AmberShell、Remote SSH 與 iSH 使用各自能力閘門；AmberShell 遵循高風險自動核准設定。

# 稳定 target 提供 Remote SSH 与 AmberShell；AmberShell 遵循高风险自动批准设置，iSH 交接能力在下方单独说明。
source: The stable target provides Remote SSH and AmberShell; AmberShell follows the high-risk auto-approval setting, and iSH handoff is described separately below.
ja: 安定版 target では Remote SSH と AmberShell を提供します。AmberShell は高リスクの自動承認設定に従い、iSH の引き継ぎ機能については下で個別に説明します。
ko: 안정 target은 Remote SSH와 AmberShell을 제공합니다. AmberShell은 고위험 자동 승인 설정을 따르며 iSH 인계 기능은 아래에서 별도로 설명합니다.
ru: Стабильный target предоставляет Remote SSH и AmberShell; AmberShell следует настройке автоматического подтверждения высокого риска, а передача iSH описана отдельно ниже.
zh_hans: 稳定 target 提供 Remote SSH 与 AmberShell；AmberShell 遵循高风险自动批准设置，iSH 交接能力在下方单独说明。
zh_hant: 穩定 target 提供 Remote SSH 與 AmberShell；AmberShell 遵循高風險自動核准設定，iSH 交接能力會在下方個別說明。

source: Asynchronous means only that Agent need not block while waiting; it is not persistent iOS background execution. On app restart, unfinished jobs are marked interrupted. AmberShell and chat share the app-owned /workspace; the Remote SSH cwd and built-in iSH /workspace are isolated from it and are not synced automatically.
ja: 非同期とは Agent が待機中にブロックされないという意味にすぎず、iOS の常駐バックグラウンド実行ではありません。App の再起動時、未完了のジョブは中断済みになります。AmberShell とチャットは App 所有の /workspace を共有しますが、Remote SSH の cwd と内蔵 iSH の /workspace はそこから分離され、自動同期されません。
ko: 비동기는 Agent가 대기 중 차단되지 않는다는 뜻일 뿐 iOS 백그라운드 상주 실행을 의미하지 않습니다. 앱을 다시 시작하면 완료되지 않은 작업은 중단됨으로 표시됩니다. AmberShell과 채팅은 앱 소유 /workspace를 공유하지만 Remote SSH cwd 및 내장 iSH /workspace는 여기서 격리되어 자동으로 동기화되지 않습니다.
ru: Асинхронность означает лишь, что Agent не обязан блокироваться в ожидании; это не постоянное фоновое выполнение на iOS. После перезапуска приложения незавершённые задания помечаются прерванными. AmberShell и чат используют принадлежащий приложению /workspace; cwd Remote SSH и /workspace встроенного iSH изолированы от него и не синхронизируются автоматически.
zh_hans: 异步只表示 Agent 不必阻塞等待，并非 iOS 后台常驻：App 重启会把未完成作业标记为已中断。AmberShell 与聊天共用 App 自有 /workspace；Remote SSH 的 cwd 与内置 iSH 的 /workspace 与其隔离，不会自动同步。
zh_hant: 非同步只代表 Agent 不必阻塞等待，並非 iOS 背景常駐執行：App 重新啟動後，未完成的工作會標記為已中斷。AmberShell 與聊天共用 App 自有的 /workspace；Remote SSH 的 cwd 與內建 iSH 的 /workspace 與其隔離，不會自動同步。

source: Smoke Test verifies the current default Runtime: Remote SSH runs echo amber-terminal-smoke, while AmberShell and iSH run pwd. AmberShell and chat share the app-owned /workspace; iSH's /workspace is inside the built-in rootfs, while Remote SSH uses its remote cwd.
ja: Smoke Test は現在のデフォルト Runtime を検証します。Remote SSH では echo amber-terminal-smoke、AmberShell と iSH では pwd を実行します。AmberShell とチャットは App 所有の /workspace を共有し、iSH の /workspace は内蔵 rootfs 内にあり、Remote SSH はリモートの cwd を使用します。
ko: Smoke Test는 현재 기본 Runtime을 확인합니다. Remote SSH에서는 echo amber-terminal-smoke를 실행하고 AmberShell과 iSH에서는 pwd를 실행합니다. AmberShell과 채팅은 앱 소유 /workspace를 공유하며 iSH의 /workspace는 내장 rootfs 안에 있고 Remote SSH는 원격 cwd를 사용합니다.
ru: Smoke Test проверяет Runtime по умолчанию: Remote SSH выполняет echo amber-terminal-smoke, а AmberShell и iSH — pwd. AmberShell и чат используют принадлежащий приложению /workspace; /workspace iSH находится во встроенном rootfs, а Remote SSH использует удалённый cwd.
zh_hans: Smoke Test 会验证当前默认 Runtime：Remote SSH 执行 echo amber-terminal-smoke，AmberShell 与 iSH 执行 pwd。AmberShell 与聊天共用 App 自有 /workspace；iSH 的 /workspace 位于内置 rootfs，Remote SSH 使用远端 cwd。
zh_hant: Smoke Test 會驗證目前的預設 Runtime：Remote SSH 執行 echo amber-terminal-smoke，AmberShell 與 iSH 執行 pwd。AmberShell 與聊天共用 App 自有的 /workspace；iSH 的 /workspace 位於內建 rootfs，Remote SSH 使用遠端 cwd。

# AmberShell；受限文件/文本命令、管道、重定向与 CPython 3.14 python -c，无 PTY
source: AmberShell; bounded file/text commands, pipelines, redirection, and CPython 3.14 python -c, without PTY
ja: AmberShell：制限付きのファイル／テキストコマンド、パイプライン、リダイレクト、CPython 3.14 の python -c（PTY なし）
ko: AmberShell: 제한된 파일/텍스트 명령, 파이프라인, 리디렉션 및 CPython 3.14 python -c, PTY 없음
ru: AmberShell: ограниченные файловые и текстовые команды, конвейеры, перенаправление и CPython 3.14 python -c, без PTY
zh_hans: AmberShell；受限文件/文本命令、管道、重定向与 CPython 3.14 python -c，无 PTY
zh_hant: AmberShell；受限檔案／文字命令、管線、重新導向與 CPython 3.14 python -c，無 PTY

# AmberShell 文件/文本命令、管道与重定向；ExperimentalGPL 不链接 CPython，无 PTY
source: AmberShell file/text commands, pipelines, and redirection; ExperimentalGPL does not link CPython, without PTY
ja: AmberShell のファイル／テキストコマンド、パイプライン、リダイレクト。ExperimentalGPL は CPython をリンクせず、PTY はありません
ko: AmberShell 파일/텍스트 명령, 파이프라인 및 리디렉션; ExperimentalGPL은 CPython을 링크하지 않으며 PTY가 없습니다
ru: Файловые и текстовые команды AmberShell, конвейеры и перенаправление; ExperimentalGPL не подключает CPython, без PTY
zh_hans: AmberShell 文件/文本命令、管道与重定向；ExperimentalGPL 不链接 CPython，无 PTY
zh_hant: AmberShell 檔案／文字命令、管線與重新導向；ExperimentalGPL 不連結 CPython，無 PTY

# 回传输出
source: Return output
ja: 出力を返す
ko: 출력 반환
ru: Вернуть вывод
zh_hans: 回传输出
zh_hant: 回傳輸出

# 仅这一次
source: This time only
ja: 今回のみ
ko: 이번만
ru: Только в этот раз
zh_hans: 仅这一次
zh_hant: 僅這一次

# AmberShell 会在 App 自有 /workspace 中执行本地命令并回传 stdout、stderr 与退出码；当前策略需要前台批准。
source: AmberShell runs local commands in the app-owned /workspace and returns stdout, stderr, and the exit code. The current policy requires foreground approval.
ja: AmberShell はアプリ所有の /workspace でローカルコマンドを実行し、stdout、stderr、終了コードを返します。現在のポリシーではフォアグラウンド承認が必要です。
ko: AmberShell은 앱 소유 /workspace에서 로컬 명령을 실행하고 stdout, stderr 및 종료 코드를 반환합니다. 현재 정책에서는 포그라운드 승인이 필요합니다.
ru: AmberShell выполняет локальные команды в принадлежащем приложению /workspace и возвращает stdout, stderr и код завершения. Текущая политика требует подтверждения на переднем плане.
zh_hans: AmberShell 会在 App 自有 /workspace 中执行本地命令并回传 stdout、stderr 与退出码；当前策略需要前台批准。
zh_hant: AmberShell 會在 App 自有的 /workspace 中執行本機命令並回傳 stdout、stderr 與結束碼；目前策略需要前景核准。

# 批准范围
source: Approval scope
ja: 承認範囲
ko: 승인 범위
ru: Область подтверждения
zh_hans: 批准范围
zh_hant: 核准範圍

# 打开网页
source: Open web page
ja: Webページを開く
ko: 웹 페이지 열기
ru: Открыть страницу
zh_hans: 打开网页
zh_hant: 開啟網頁

# 读取网页标签页
source: Read browser tabs
ja: Webタブを読み取る
ko: 웹 탭 읽기
ru: Прочитать вкладки
zh_hans: 读取网页标签页
zh_hant: 讀取網頁分頁

# 新建网页标签页
source: New browser tab
ja: 新しいWebタブ
ko: 새 웹 탭
ru: Новая вкладка
zh_hans: 新建网页标签页
zh_hant: 新增網頁分頁

# 关闭网页标签页
source: Close browser tab
ja: Webタブを閉じる
ko: 웹 탭 닫기
ru: Закрыть вкладку
zh_hans: 关闭网页标签页
zh_hant: 關閉網頁分頁

# 观察网页
source: Observe web page
ja: Webページを観察
ko: 웹 페이지 관찰
ru: Наблюдать страницу
zh_hans: 观察网页
zh_hant: 觀察網頁

# 提取网页内容
source: Extract page content
ja: ページ内容を抽出
ko: 페이지 콘텐츠 추출
ru: Извлечь содержимое
zh_hans: 提取网页内容
zh_hant: 擷取網頁內容

# 读取网页节点
source: Read page node
ja: ページノードを読み取る
ko: 페이지 노드 읽기
ru: Прочитать узел страницы
zh_hans: 读取网页节点
zh_hant: 讀取網頁節點

# 读取视觉快照
source: Read visual snapshot
ja: ビジュアルスナップショットを読み取る
ko: 시각적 스냅샷 읽기
ru: Прочитать снимок
zh_hans: 读取视觉快照
zh_hant: 讀取視覺快照

# 截取网页视口
source: Capture page viewport
ja: ページ表示範囲を撮影
ko: 페이지 뷰포트 캡처
ru: Снять область страницы
zh_hans: 截取网页视口
zh_hant: 截取網頁視窗

# 读取网页状态
source: Read page state
ja: ページ状態を読み取る
ko: 페이지 상태 읽기
ru: Прочитать состояние страницы
zh_hans: 读取网页状态
zh_hant: 讀取網頁狀態

# 网页后退
source: Go back
ja: 戻る
ko: 뒤로 이동
ru: Назад
zh_hans: 网页后退
zh_hant: 網頁後退

# 网页前进
source: Go forward
ja: 進む
ko: 앞으로 이동
ru: Вперёд
zh_hans: 网页前进
zh_hant: 網頁前進

# 清理 WebMount Session
source: Clear WebMount session
ja: WebMountセッションを消去
ko: WebMount 세션 지우기
ru: Очистить сеанс WebMount
zh_hans: 清理站点 Session
zh_hant: 清理站點工作階段

# 移除 WebMount 站点
source: Remove WebMount site
ja: WebMountサイトを削除
ko: WebMount 사이트 제거
ru: Удалить сайт WebMount
zh_hans: 移除站点
zh_hant: 移除站點

# 读取 WebMount 站点
source: Read WebMount sites
ja: WebMountサイトを読み取る
ko: WebMount 사이트 읽기
ru: Прочитать сайты WebMount
zh_hans: 读取站点
zh_hant: 讀取站點

# 点击网页元素
source: Click page element
ja: ページ要素をクリック
ko: 페이지 요소 클릭
ru: Нажать элемент страницы
zh_hans: 点击网页元素
zh_hant: 點擊網頁元素

# 点击网页
source: Tap web page
ja: Webページをタップ
ko: 웹 페이지 탭
ru: Нажать на страницу
zh_hans: 点击网页
zh_hant: 點擊網頁

# 输入网页字段
source: Type in page field
ja: ページ項目に入力
ko: 페이지 필드에 입력
ru: Ввести в поле страницы
zh_hans: 输入网页字段
zh_hant: 輸入網頁欄位

# 发送网页按键
source: Send page keys
ja: ページにキーを送信
ko: 페이지 키 보내기
ru: Отправить клавиши
zh_hans: 发送网页按键
zh_hant: 傳送網頁按鍵

# 滚动网页
source: Scroll web page
ja: Webページをスクロール
ko: 웹 페이지 스크롤
ru: Прокрутить страницу
zh_hans: 滚动网页
zh_hant: 捲動網頁

# 选择网页选项
source: Select page option
ja: ページ項目を選択
ko: 페이지 옵션 선택
ru: Выбрать параметр
zh_hans: 选择网页选项
zh_hant: 選擇網頁選項

# 查找网页内容
source: Find page content
ja: ページ内容を検索
ko: 페이지 콘텐츠 찾기
ru: Найти на странице
zh_hans: 查找网页内容
zh_hant: 尋找網頁內容

# 等待网页条件
source: Wait for page condition
ja: ページ条件を待機
ko: 페이지 조건 대기
ru: Ждать условие страницы
zh_hans: 等待网页条件
zh_hant: 等待網頁條件

# exit %ld · 无输出
source: exit %ld · No output
ja: exit %ld · 出力なし
ko: exit %ld · 출력 없음
ru: exit %ld · Нет вывода
zh_hans: exit %ld · 无输出
zh_hant: exit %ld · 無輸出

# Amber 需要你回答
source: Amber needs your answer
ja: Amber が回答を求めています
ko: Amber가 답변을 기다리고 있습니다.
ru: Amber ждёт вашего ответа
zh_hans: Amber 需要你回答
zh_hant: Amber 需要你回答

# 同步到手表失败，将在连接恢复后重试
source: Sync to Apple Watch failed. We'll retry when the connection is restored.
ja: Apple Watch への同期に失敗しました。接続が復旧すると再試行します
ko: Apple Watch 동기화에 실패했습니다. 연결이 복구되면 다시 시도합니다.
ru: Не удалось синхронизировать с Apple Watch. Повторим после восстановления соединения.
zh_hans: 同步到手表失败，将在连接恢复后重试
zh_hant: 同步至手錶失敗，連線恢復後將重試

# 目标、服务或发送内容无法在手表完整显示，请在 iPhone 查看。
source: This target, service, or content can't be fully shown on Apple Watch. View it on iPhone.
ja: この対象、サービス、または送信内容は Apple Watch に完全には表示できません。iPhone で確認してください
ko: 이 대상, 서비스 또는 보낼 내용은 Apple Watch에 모두 표시할 수 없습니다. iPhone에서 확인하세요.
ru: Этот адрес, сервис или содержимое нельзя полностью показать на Apple Watch. Откройте на iPhone.
zh_hans: 目标、服务或发送内容无法在手表完整显示，请在 iPhone 查看。
zh_hant: 目標、服務或傳送內容無法在手錶完整顯示，請在 iPhone 查看。

# 目标地址
source: Target URL
ja: 対象アドレス
ko: 대상 주소
ru: Адрес назначения
zh_hans: 目标地址
zh_hant: 目標地址

# 发送内容
source: Content to send
ja: 送信内容
ko: 보낼 내용
ru: Отправляемое содержимое
zh_hans: 发送内容
zh_hant: 傳送內容

# 服务
source: Service
ja: サービス
ko: 서비스
ru: Сервис
zh_hans: 服务
zh_hant: 服務

# 服务类型
source: Service type
ja: サービスの種類
ko: 서비스 유형
ru: Тип сервиса
zh_hans: 服务类型
zh_hant: 服務類型

# 点按查看任务并继续。
source: Tap to view the task and continue.
ja: タップしてタスクを確認し、続行します。
ko: 탭하여 작업을 확인하고 계속하세요.
ru: Нажмите, чтобы открыть задачу и продолжить.
zh_hans: 点按查看任务并继续。
zh_hant: 點按查看任務並繼續。

# 笔记尚未同步，请稍后重试
source: The note hasn't synced yet. Please try again later.
ja: メモはまだ同期されていません。しばらくしてからもう一度お試しください
ko: 메모가 아직 동기화되지 않았습니다. 나중에 다시 시도하세요.
ru: Заметка ещё не синхронизирована, повторите позже.
zh_hans: 笔记尚未同步，请稍后重试
zh_hant: 筆記尚未同步，請稍後重試

# 请将 iPhone 和 Apple Watch 上的 Amber 更新到相同版本
source: Update Amber on iPhone and Apple Watch to the same version.
ja: iPhone と Apple Watch の Amber を同じバージョンに更新してください
ko: iPhone과 Apple Watch의 Amber를 같은 버전으로 업데이트하세요.
ru: Обновите Amber на iPhone и Apple Watch до одной и той же версии.
zh_hans: 请将 iPhone 和 Apple Watch 上的 Amber 更新到相同版本
zh_hant: 請將 iPhone 與 Apple Watch 上的 Amber 更新至相同版本
